skydivervrn/flysight-2-firmware/STM32_WPAN/App/app_ble.c
          /* USER CODE BEGIN EVT_LE_CONN_UPDATE_COMPLETE */

          /* USER CODE END EVT_LE_CONN_UPDATE_COMPLETE */
          break;

        case HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE:
          p_enhanced_connection_complete_event = (hci_le_enhanced_connection_complete_event_rp0 *) p_meta_evt->data;
          /**
           * The connection is done, there is no need anymore to schedule the LP ADV
           */

          connection_handle = p_enhanced_connection_complete_event->Connection_Handle;
          role = p_enhanced_connection_complete_event->Role;

#if FS_BLE_DIAG
          /* Record 4, the first half — and the single most informative line in
           * the file for this bug. role=1 is us as PERIPHERAL, i.e. a phone or
           * the Mac got past the whitelist filter. peer_type 0x00/0x01 is a plain
           * public/random identity; 0x02/0x03 mean the controller RESOLVED the
           * peer's private address against the resolving list, so peer_addr is
           * the identity behind it and peer_rpa is what was actually on the air.
           * A phone that only ever gets in after a double-press should show
           * peer_type 0x01 with a peer_rpa-shaped address here — that is the
           * signature of "known device, unresolvable identity". */
          {
            char idStr[18], rpaStr[18];
            FS_BleDiag_FormatAddr(idStr, sizeof(idStr),
                p_enhanced_connection_complete_event->Peer_Address);
            FS_BleDiag_FormatAddr(rpaStr, sizeof(rpaStr),
                p_enhanced_connection_complete_event->Peer_Resolvable_Private_Address);
            FS_BleDiag_Log("CONN st=0x%02X role=%u handle=0x%04X ptype=%u paddr=%s",
                (unsigned) p_enhanced_connection_complete_event->Status,
                (unsigned) role, (unsigned) connection_handle,
                (unsigned) p_enhanced_connection_complete_event->Peer_Address_Type,
                idStr);
            FS_BleDiag_Log("CONN handle=0x%04X peer_rpa=%s int=%u to=%u",
                (unsigned) connection_handle, rpaStr,
                (unsigned) p_enhanced_connection_complete_event->Conn_Interval,
                (unsigned) p_enhanced_connection_complete_event->Supervision_Timeout);
          }
#endif

          if (p_enhanced_connection_complete_event->Status != BLE_STATUS_SUCCESS)
          {
            if (role == 0x00)
            {
              APP_DBG_MSG("-- CONNECTION WITH END DEVICE 1 FAILED: 0x%02X\n\r",
                          p_enhanced_connection_complete_event->Status);
              FS_Log_WriteEventAsync("ENGO GATT setup failed: connection complete 0x%02X",
                  (unsigned)p_enhanced_connection_complete_event->Status);

              /* A failed connection-complete has no usable handle and does not
               * produce a disconnection-complete event. Keep the required
               * ForceDisconnect call (a safe no-op with the invalid client
               * handle), then perform the same cleanup and rescan explicitly. */
              FS_ActiveLook_Client_ForceDisconnect();
              BleApplicationContext.EndDevice_Connection_Status[0] = APP_BLE_IDLE;
              BleApplicationContext.connectionHandleEndDevice1 = 0xFFFF;
              FS_ActiveLook_Client_OnDisconnect();
              FS_ActiveLook_OnDisconnect();
              UTIL_SEQ_SetTask(1 << CFG_TASK_START_SCAN_ID, CFG_SCH_PRIO_0);
            }
            else
            {
              APP_DBG_MSG("-- CONNECTION WITH SMART PHONE FAILED: 0x%02X\n\r",
                          p_enhanced_connection_complete_event->Status);
              BleApplicationContext.SmartPhone_Connection_Status = APP_BLE_IDLE;
              BleApplicationContext.connectionHandleCentral = 0xFFFF;
            }
            break;
          }

          if (role == 0x00)
          { /* ROLE CENTRAL */
            APP_DBG_MSG("-- CONNECTION SUCCESS WITH END DEVICE 1\n\r");
            BleApplicationContext.EndDevice_Connection_Status[0] = APP_BLE_CONNECTED;
            BleApplicationContext.connectionHandleEndDevice1 = connection_handle;
            FS_ActiveLook_OnDiscoveryStart();
            FS_ActiveLook_Client_StartDiscovery(connection_handle);
          }
          else
          {
            APP_DBG_MSG("-- CONNECTION SUCCESS WITH SMART PHONE\n\r");
            BleApplicationContext.SmartPhone_Connection_Status = APP_BLE_CONNECTED;
            BleApplicationContext.connectionHandleCentral = connection_handle;

            /* Remember who this is, for the poisoned-bond self-heal at
             * disconnect. Types 0x02/0x03 mean the controller already resolved
             * a private address: Peer_Address then IS the identity, of type
             * public (0x00) or static-random (0x01) respectively — the same
             * form the bonding table stores. */
            central_id_type = p_enhanced_connection_complete_event->Peer_Address_Type;
            if (central_id_type >= 0x02)
            {
              central_id_type -= 0x02;
            }
            memcpy(central_id_addr,
                   p_enhanced_connection_complete_event->Peer_Address, 6);
            central_id_valid = 1;
            central_pair_ok = 0;
            central_conn_tick = HAL_GetTick();
            HandleNotification.Custom_Evt_Opcode = CUSTOM_CONN_HANDLE_EVT;
            HandleNotification.ConnectionHandle = connection_handle;
            Custom_APP_Notification(&HandleNotification);

            /* Stop the timer */
            HW_TS_Stop(Advertising_mgr_timer_Id);

            /* Call advertising callback */
            if (Adv_Callback) Adv_Callback();

            /* Update advertising callback */
            Adv_Callback = Next_Adv_Callback;
            Next_Adv_Callback = 0;

            /* Configure the link */
            UTIL_SEQ_SetTask(1 << CFG_TASK_LINK_CONFIG_ID, CFG_SCH_PRIO_1);
          }
          break; /* HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */

        case HCI_LE_ADVERTISING_REPORT_SUBEVT_CODE:
          /* USER CODE BEGIN EVT_LE_ADVERTISING_REPORT */

