skydivervrn/flysight-2-firmware/STM32_WPAN/App/app_ble.c
          /* USER CODE END EVT_LE_ADVERTISING_REPORT */
          le_advertising_event = (hci_le_advertising_report_event_rp0 *) p_meta_evt->data;

          event_type = le_advertising_event->Advertising_Report[0].Event_Type;

          event_data_size = le_advertising_event->Advertising_Report[0].Length_Data;

          /* WARNING: be careful when decoding advertising report as its raw format cannot be mapped on a C structure.
          The data and RSSI values could not be directly decoded from the RAM using the data and RSSI field from hci_le_advertising_report_event_rp0 structure.
          Instead they must be read by using offsets (please refer to BLE specification).
          RSSI = (int8_t)*(uint8_t*) (adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data);
          */
          adv_report_data = (uint8_t*)(&le_advertising_event->Advertising_Report[0].Length_Data) + 1;

          /* Process both ADV_IND and SCAN_RSP so service UUID in scan response is caught */
          if (event_type == ADV_IND || event_type == SCAN_RSP)
          {
            FS_ActiveLookAdvResult adv;
            uint8_t validAdv = FS_ActiveLookAdv_Parse(adv_report_data,
                                                       event_data_size, &adv);
            uint8_t foundUUID = adv.found_uuid;
            uint8_t foundName = adv.found_name;
            uint8_t haveSerial = adv.have_serial;
            const char *candSerial = adv.serial;
            const char *candName = adv.name;

            if (!validAdv)
              APP_DBG_MSG("-- Malformed advertising data ignored\n\r");
            else
            {
              if (foundUUID)
                APP_DBG_MSG("-- Found ActiveLook service UUID in adv data\n\r");
              if (candName[0])
                APP_DBG_MSG("-- Found Device Name: '%s'\n\r", candName);
              if (foundName)
                APP_DBG_MSG("-- ActiveLook name prefix matched\n\r");
            }

            /* Decide whether to accept this device.
             *  - BOUND   (engo3.txt present): must be an ActiveLook device (UUID or
             *            name prefix) AND its serial (trailing 6 chars of the
             *            advertised name) must equal the saved one. The serial
             *            NARROWS the ActiveLook filter, it does not replace it —
             *            otherwise any BLE device whose name happens to end in
             *            those 6 chars would be connected to.
             *  - UNBOUND (no engo3.txt): first ActiveLook device wins (UUID or
             *            name prefix), and we remember its serial to persist once
             *            the link is up (auto-bind on first ever connect). */
            uint8_t accept = 0;
            if (validAdv && BleApplicationContext.EndDevice1Found == 0x00)
            {
              if (FS_EngoBind_IsBound())
                accept = ((foundUUID || foundName) &&
                          haveSerial && FS_EngoBind_SerialMatches(candSerial));
              else
                accept = (foundUUID || foundName);
            }

            if (accept)
            {
              APP_DBG_MSG("-- Found matching ENGO/ActiveLook device!\n\r");
              BleApplicationContext.EndDevice1Found = 0x01;

              FS_Log_WriteEventAsync("ENGO found: '%s' (name=%u uuid=%u) addr %02X:%02X:%02X:%02X:%02X:%02X",
                  candName[0] ? candName : "?", foundName, foundUUID,
                  le_advertising_event->Advertising_Report[0].Address[5],
                  le_advertising_event->Advertising_Report[0].Address[4],
                  le_advertising_event->Advertising_Report[0].Address[3],
                  le_advertising_event->Advertising_Report[0].Address[2],
                  le_advertising_event->Advertising_Report[0].Address[1],
                  le_advertising_event->Advertising_Report[0].Address[0]);

              /* Unbound first connect: stash the serial to learn after link-up. */
              if (!FS_EngoBind_IsBound() && haveSerial)
                FS_EngoBind_NotePending(candSerial);

              /* Store BD Address and Address_Type from the advertising report */
              P2P_SERVER1_BDADDR[0] = le_advertising_event->Advertising_Report[0].Address[0];
              P2P_SERVER1_BDADDR[1] = le_advertising_event->Advertising_Report[0].Address[1];
              P2P_SERVER1_BDADDR[2] = le_advertising_event->Advertising_Report[0].Address[2];
              P2P_SERVER1_BDADDR[3] = le_advertising_event->Advertising_Report[0].Address[3];
              P2P_SERVER1_BDADDR[4] = le_advertising_event->Advertising_Report[0].Address[4];
              P2P_SERVER1_BDADDR[5] = le_advertising_event->Advertising_Report[0].Address[5];
              P2P_SERVER1_ADDR_TYPE  = le_advertising_event->Advertising_Report[0].Address_Type;

              APP_DBG_MSG("   Address (%s): %02X:%02X:%02X:%02X:%02X:%02X\n\r",
                          P2P_SERVER1_ADDR_TYPE == 0 ? "Public" : "Random",
                          P2P_SERVER1_BDADDR[5], P2P_SERVER1_BDADDR[4], P2P_SERVER1_BDADDR[3],
                          P2P_SERVER1_BDADDR[2], P2P_SERVER1_BDADDR[1], P2P_SERVER1_BDADDR[0]);
            }
          } /* end if (event_type == ADV_IND || event_type == SCAN_RSP) */
          break;

        default:
          /* USER CODE BEGIN SUBEVENT_DEFAULT */

          /* USER CODE END SUBEVENT_DEFAULT */
          break;
      }

      /* USER CODE BEGIN META_EVT */

      /* USER CODE END META_EVT */
      break; /* HCI_LE_META_EVT_CODE */
    }

    case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
      p_blecore_evt = (evt_blecore_aci*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_VENDOR */

      /* USER CODE END EVT_VENDOR */
      switch (p_blecore_evt->ecode)
      {
        /* USER CODE BEGIN ecode */

        /* USER CODE END ecode */

        /**
         * SPECIFIC to Custom Template APP
         */
        case ACI_L2CAP_CONNECTION_UPDATE_REQ_VSEVT_CODE:
          {
            /* USER CODE BEGIN EVT_BLUE_L2CAP_CONNECTION_UPDATE_REQ */

            /* USER CODE END EVT_BLUE_L2CAP_CONNECTION_UPDATE_REQ */
            pr = (aci_l2cap_connection_update_req_event_rp0 *) p_blecore_evt->data;
            result = aci_l2cap_connection_parameter_update_resp(pr->Connection_Handle,
                                                                pr->Interval_Min,
                                                                pr->Interval_Max,
                                                                pr->Latency,
                                                                pr->Timeout_Multiplier,
                                                                CONN_L1,
                                                                CONN_L2,
																pr->Identifier,
                                                                0x00);
            APP_DBG_MSG("\r\n\r** NO UPDATE \n\r");
            if(result != BLE_STATUS_SUCCESS)
            {
              /* USER CODE BEGIN BLE_STATUS_SUCCESS */

