skydivervrn/flysight-2-firmware/STM32_WPAN/App/app_ble.c
              /* USER CODE END BLE_STATUS_SUCCESS */
            }
          }
          break;

        case ACI_L2CAP_CONNECTION_UPDATE_RESP_VSEVT_CODE:
#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
          mutex = 1;
#endif /* L2CAP_REQUEST_NEW_CONN_PARAM != 0 */
          /* USER CODE BEGIN EVT_BLUE_L2CAP_CONNECTION_UPDATE_RESP */

          /* USER CODE END EVT_BLUE_L2CAP_CONNECTION_UPDATE_RESP */
          break;

        case ACI_GAP_PROC_COMPLETE_VSEVT_CODE:
          {
            /* USER CODE BEGIN EVT_BLUE_GAP_PROCEDURE_COMPLETE */

            /* USER CODE END EVT_BLUE_GAP_PROCEDURE_COMPLETE */
            aci_gap_proc_complete_event_rp0 *gap_evt_proc_complete = (void*) p_blecore_evt->data;
            /* CHECK GAP GENERAL DISCOVERY PROCEDURE COMPLETED & SUCCEED */
            if (gap_evt_proc_complete->Procedure_Code == GAP_GENERAL_DISCOVERY_PROC
                && gap_evt_proc_complete->Status == 0x00)
            {
              /* USER CODE BEGIN GAP_GENERAL_DISCOVERY_PROC */

              /* USER CODE END GAP_GENERAL_DISCOVERY_PROC */

              APP_DBG_MSG("-- GAP GENERAL DISCOVERY PROCEDURE_COMPLETED\n\r");
              /*if a device found, connect to it, device 1 being chosen first if both found*/
              if (BleApplicationContext.EndDevice1Found == 0x01
                  && BleApplicationContext.EndDevice_Connection_Status[0] != APP_BLE_CONNECTED)
              {
                APP_DBG_MSG("-- Setting task CFG_TASK_CONN_DEV_1_ID\n\r");
                UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_1_ID, CFG_SCH_PRIO_0);
              }
              else if (BleApplicationContext.EndDevice_Connection_Status[0] != APP_BLE_CONNECTED)
              {
                /* No matching device found — re-arm scanning so glasses found later */
                APP_DBG_MSG("-- No ENGO device found, re-scheduling scan\n\r");
                UTIL_SEQ_SetTask(1 << CFG_TASK_START_SCAN_ID, CFG_SCH_PRIO_0);
              }
#if (CFG_P2P_DEMO_MULTI != 0)
              /* USER CODE BEGIN EVT_BLUE_GAP_PROCEDURE_COMPLETE_Multi */

              /* USER CODE END EVT_BLUE_GAP_PROCEDURE_COMPLETE_Multi */
#endif
            }
            /* A discovery WE terminated to free the resolving list completes
             * with a NON-ZERO status, and the branch above only re-arms the
             * scan on 0x00 — so as written the ENGO scan would stop for good
             * at the first 0x0C, and the deferred rebuild in Scan_Request
             * would never run either. Re-arm it here. Gated on the flag, which
             * exactly one place sets, so an ordinary failed discovery is left
             * to behave as it always did. */
            else if (gap_evt_proc_complete->Procedure_Code == GAP_GENERAL_DISCOVERY_PROC
                     && resolving_list_dirty)
            {
              FS_BleDiag_Log("RL retry: scan ended status=0x%02X, rescheduling",
                  (unsigned) gap_evt_proc_complete->Status);
              UTIL_SEQ_SetTask(1 << CFG_TASK_START_SCAN_ID, CFG_SCH_PRIO_0);
            }
          }
          break; /* ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE */

#if (RADIO_ACTIVITY_EVENT != 0)
        case ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE:
          /* USER CODE BEGIN RADIO_ACTIVITY_EVENT*/

          /* USER CODE END RADIO_ACTIVITY_EVENT*/
          break; /* ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE */
#endif /* RADIO_ACTIVITY_EVENT != 0 */

        /* PAIRING */
        case (ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE):
          APP_DBG_MSG(">>== ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE\n");
          /* USER CODE BEGIN ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE*/

          /* USER CODE END ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE*/
          break;

        case ACI_GAP_PASS_KEY_REQ_VSEVT_CODE:
          APP_DBG_MSG(">>== ACI_GAP_PASS_KEY_REQ_VSEVT_CODE \n");

          ret = aci_gap_pass_key_resp(BleApplicationContext.connectionHandleCentral, CFG_FIXED_PIN);
          if (ret != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("==>> aci_gap_pass_key_resp : Fail, reason: 0x%x\n", ret);
          }
          else
          {
            APP_DBG_MSG("==>> aci_gap_pass_key_resp : Success \n");
          }
          /* USER CODE BEGIN ACI_GAP_PASS_KEY_REQ_VSEVT_CODE*/

          /* USER CODE END ACI_GAP_PASS_KEY_REQ_VSEVT_CODE*/
          break;

        case ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE:
          APP_DBG_MSG(">>== ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE\n");
          APP_DBG_MSG("     - numeric_value = %ld\n",
                      ((aci_gap_numeric_comparison_value_event_rp0 *)(p_blecore_evt->data))->Numeric_Value);
          APP_DBG_MSG("     - Hex_value = %lx\n",
                      ((aci_gap_numeric_comparison_value_event_rp0 *)(p_blecore_evt->data))->Numeric_Value);
          ret = aci_gap_numeric_comparison_value_confirm_yesno(BleApplicationContext.connectionHandleCentral, YES);
          if (ret != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("==>> aci_gap_numeric_comparison_value_confirm_yesno-->YES : Fail, reason: 0x%x\n", ret);
          }
          else
          {
            APP_DBG_MSG("==>> aci_gap_numeric_comparison_value_confirm_yesno-->YES : Success \n");
          }
          /* USER CODE BEGIN ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE*/

          /* USER CODE END ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE*/
          break;

        case ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE:
          p_pairing_complete = (aci_gap_pairing_complete_event_rp0*)p_blecore_evt->data;

          APP_DBG_MSG(">>== ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE\n");
          if (p_pairing_complete->Status != 0)
          {
            APP_DBG_MSG("     - Pairing KO \n     - Status: 0x%x\n     - Reason: 0x%x\n", p_pairing_complete->Status, p_pairing_complete->Reason);
          }
          else
          {
            APP_DBG_MSG("     - Pairing Success\n");
          }
          APP_DBG_MSG("\n");

          /* USER CODE BEGIN ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE*/
          /* Record 3. Status 0x00 success, 0x01 timeout, 0x02 failed; on 0x02
           * Reason carries the SMP pairing-failed code (0x03 authentication
           * requirements, 0x05 pairing not supported, 0x08 unspecified...). */
          FS_BleDiag_Log("PAIR_CPLT handle=0x%04X status=0x%02X reason=0x%02X",
              (unsigned) p_pairing_complete->Connection_Handle,
              (unsigned) p_pairing_complete->Status,
              (unsigned) p_pairing_complete->Reason);

          /* ...and the bond count immediately afterwards. This is a READ-ONLY
           * ACI query and nothing else: it does not rebuild the whitelist and
           * does not touch the resolving list, so the BLE path behaves exactly
           * as it did without this build. It answers the one question the
           * pairing-complete event does not — whether a "successful" pairing
           * actually left a bond behind for the next reconnect to match. */
#if FS_BLE_DIAG
          {
            uint8_t nb = 0;
            Bonded_Device_Entry_t nb_devices[16];
            tBleStatus nb_ret = aci_gap_get_bonded_devices(&nb, nb_devices);
            FS_BleDiag_Log("PAIR_BONDS get_bonded=0x%02X n=%u",
                (unsigned) nb_ret, (unsigned) nb);
          }
#endif
          /* A successful pairing OR re-encryption of a bonded reconnect both
           * land here with status 0 — either way this link's bond is proven
           * good, so it must not count towards eviction. */
          if (p_pairing_complete->Status == 0
              && p_pairing_complete->Connection_Handle
                  == BleApplicationContext.connectionHandleCentral)
          {
            central_pair_ok = 1;
          }
          /* USER CODE END ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE*/
          break;

        /* USER CODE BEGIN ACI_GAP_SECURITY_VSEVT_CODES */
        case ACI_GAP_BOND_LOST_VSEVT_CODE:
          /* The peer is re-pairing over a bond we still hold — i.e. it threw
           * its key away and we did not. Per ble_gap_aci.h the application MUST
           * answer with aci_gap_allow_rebond or the pairing procedure times
           * out; nothing here ever called it, so a peer that lost its bond
           * could never get back in. Allow it: the double-press pairing window
           * is still the only way an unbonded central reaches pairing at all,
           * so this only lets a device the owner already trusted re-pair. */
          {
            tBleStatus rebond_ret = aci_gap_allow_rebond(
                BleApplicationContext.connectionHandleCentral);
            FS_BleDiag_Log("BOND_LOST allow_rebond=0x%02X", (unsigned) rebond_ret);
          }
          break;

        case ACI_GAP_ADDR_NOT_RESOLVED_VSEVT_CODE:
          /* The other half of the hypothesis, stated by the controller itself:
           * a peer turned up with a resolvable private address that no identity
           * in the resolving list could resolve. With privacy enabled and a
           * whitelist-only filter, this is precisely how a genuinely bonded
           * phone gets refused.
           *
           * READ THE ABSENCE OF THIS LINE WITH CARE. The firmware never calls
           * aci_gap_set_event_mask, so both this event (mask bit 0x0800) and
           * BOND_LOST (0x0080) arrive only if the stack's default mask has them
           * on. ble_gap_aci.h documents that default as 0xFFFF — every GAP event
           * enabled — and ACI_GAP_PAIRING_COMPLETE, bit 0x0001 of the same mask,
           * demonstrably does arrive here today without anyone setting it, which
           * is good evidence the default is indeed all-on. Good evidence, not
           * proof: it is NOT verified on this unit, and setting the mask
           * ourselves would be new behaviour on the BLE path, which this build
           * is not allowed. So a file with no ADDR_NOT_RESOLVED line is weak
           * evidence that resolution never failed, whereas one WITH the line is
           * conclusive that it did. */
          FS_BleDiag_Log("ADDR_NOT_RESOLVED handle=0x%04X",
              (unsigned) ((aci_gap_addr_not_resolved_event_rp0 *)(p_blecore_evt->data))->Connection_Handle);
          break;
        /* USER CODE END ACI_GAP_SECURITY_VSEVT_CODES */
        /* PAIRING */
        case ACI_GATT_INDICATION_VSEVT_CODE:
        {
          APP_DBG_MSG(">>== ACI_GATT_INDICATION_VSEVT_CODE \r");
          aci_gatt_confirm_indication(BleApplicationContext.connectionHandleCentral);
        }
        break;

